---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CwpReuseExistingGrids
source: html/0985b3c7-ae92-18c0-214d-9234941b59a9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CwpReuseExistingGrids Property

"Reuse matching Grids"

## Syntax (C#)
```csharp
public static ForgeTypeId CwpReuseExistingGrids { get; }
```